//;******************************************************************************
//;* Copyright (c) 1983-2013, Insyde Software Corporation. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************

/=#
#langdef en-US "English"
#langdef fr-FR "Français"
#langdef zh-TW "\wide中文\narrow"
#langdef ja-JP "\wide日本語\narrow"
#langdef it-IT "Italian"
#langdef es-ES "Spanish"
#langdef de-DE "German"
#langdef pt-PT "Portuguese"

//
// APEI(WHEA)
//
#string STR_WHEA_TITLE                  #language en-US "APEI Configuration"
#string STR_WHEA_PROMPT                 #language en-US "APEI Support"
#string STR_WHEA_PROMPT_FULL_NAME       #language en-US "ACPI Platform Error Interface"
#string STR_WHEA_HELP                   #language en-US "Disables/Enables ACPI Platform Error Interface(WHEA).  APEI extends existing hardware error reporting mechanisms and brings them together as components of a coherent hardware error infrastructure."
#string STR_WHEA_ENABLE                 #language en-US "Enable"
#string STR_WHEA_DISABLE                #language en-US "Disable"
#string STR_WHEA_DEFRAG                 #language en-US "Defrag Level"
#string STR_WHEA_DEFRAG_HELP            #language en-US "Defrag ROM Level"

#string STR_WHEA_DEFRAG_ONE_FOURTH      #language en-US "ROM Space under 1/4"
#string STR_WHEA_DEFRAG_ONE_THIRD       #language en-US "ROM Space under 1/3"
#string STR_WHEA_DEFRAG_HALF            #language en-US "ROM Space under 1/2"
#string STR_WHEA_DEFRAG_EVERY_ERROR     #language en-US "Every time When Error Occur"

#string STR_WHEA_EINJ_PROMPT            #language en-US "APEI Error Injection"
#string STR_WHEA_EINJ_HELP              #language en-US "Inject an error to test APEI feature"
#string STR_WHEA_EINJ_0001              #language en-US "PROCESSOR_CE"
#string STR_WHEA_EINJ_0002              #language en-US "PROCESSOR_UE_NON_FATAL"
#string STR_WHEA_EINJ_0004              #language en-US "PROCESSOR_UE_FATAL"
#string STR_WHEA_EINJ_0008              #language en-US "MEMORY_CE"
#string STR_WHEA_EINJ_0010              #language en-US "MEMORY_UE_NON_FATAL"
#string STR_WHEA_EINJ_0020              #language en-US "MEMORY_UE_FATAL"
#string STR_WHEA_EINJ_0040              #language en-US "PCIE_CE"
#string STR_WHEA_EINJ_0080              #language en-US "PCIE_UE_NON_FATAL"
#string STR_WHEA_EINJ_0100              #language en-US "PCIE_UE_FATAL"
#string STR_WHEA_EINJ_0200              #language en-US "PLATFORM_CE"
#string STR_WHEA_EINJ_0400              #language en-US "PLATFORM_UE_NON_FATAL"
#string STR_WHEA_EINJ_0800              #language en-US "PLATFORM_UE_FATAL"

//[-start-140425-IB10310054-add]//
#string STR_WHEA_UEFI_REV_PROMPT        #language en-US "APEI UEFI Revision"
#string STR_WHEA_UEFI_REV_HELP          #language en-US "UEFI revision of APEI error format."
#string STR_WHEA_UEFI_REV_UEFI22        #language en-US "UEFI 2.2"
#string STR_WHEA_UEFI_REV_UEFI23        #language en-US "UEFI 2.3.1"
//[-end-140425-IB10310054-add]//

